
local Text = {}

Text.shareStageScore = {
	title = "我在超好玩的《开心爱消除》游戏中，获得了@STAGE_SCORE分，快来挑战我吧！",
	desc = "开心爱消除，最好玩的消除游戏",
	
}

Text.shareTaskMoney = {
	[1] =
	{
		title = "我在《开心爱消除》游戏中打飞了3只小怪兽，闯过了第10关！敢来比比吗？",
		desc = "开心爱消除，最好玩的消除游戏",
	},
	[2] =
	{
		title = "我在《开心爱消除》游戏中打飞了4只小怪兽，闯过了第20关！敢来比比吗？",
		desc = "开心爱消除，最好玩的消除游戏",
	},
	[3] =
	{
		title = "我在《开心爱消除》游戏中打飞了5只小怪兽，闯过了第30关！敢来比比吗？",
		desc = "开心爱消除，最好玩的消除游戏",
	},
	[4] =
	{
		title = "我在《开心爱消除》游戏中打飞了5只小怪兽，闯过了第40关！敢来比比吗？",
		desc = "开心爱消除，最好玩的消除游戏",
	},
	[5] =
	{
		title = "我在《开心爱消除》游戏中打飞了5只小怪兽，闯过了第50关！敢来比比吗？",
		desc = "开心爱消除，最好玩的消除游戏",
	},
	[6] =
	{
		title = "我在《开心爱消除》游戏中打飞了5只小怪兽，闯过了第60关！敢来比比吗？",
		desc = "开心爱消除，最好玩的消除游戏",
	},
	[7] =
	{
		title = "我在《开心爱消除》无尽模式中打飞了10只小怪兽！你能比我更厉害吗？",
		desc = "开心爱消除，最好玩的消除游戏",
	},
	[8] =
	{
		title = "我在《开心爱消除》无尽模式中打飞了20只小怪兽！你能比我更厉害吗？",
		desc = "开心爱消除，最好玩的消除游戏",
	},
	[9] =
	{
		title = "我在《开心爱消除》无尽模式中打飞了30只小怪兽！你能比我更厉害吗？",
		desc = "开心爱消除，最好玩的消除游戏",
	},
	[10] =
	{
		title = "我在《开心爱消除》游戏中，把超人升到了10级！",
		desc = "开心爱消除，最好玩的消除游戏",
	},
	[11] =
	{
		title = "我在《开心爱消除》游戏中，把超人升到了20级！",
		desc = "开心爱消除，最好玩的消除游戏",
	},
	[12] =
	{
		title = "我在《开心爱消除》游戏中，把超人升到了30级！",
		desc = "开心爱消除，最好玩的消除游戏",
	},
	[13] =
	{
		title = "我在《开心爱消除》关卡模式中收集到了30颗星星！",
		desc = "开心爱消除，最好玩的消除游戏",
	},
	[14] =
	{
		title = "我在《开心爱消除》关卡模式中收集到了60颗星星！",
		desc = "开心爱消除，最好玩的消除游戏",
	},
	[15] =
	{
		title = "我在《开心爱消除》关卡模式中收集到了90颗星星！",
		desc = "开心爱消除，最好玩的消除游戏",
	},
	[16] =
	{
		title = "我在《开心爱消除》关卡模式中收集到了120颗星星！",
		desc = "开心爱消除，最好玩的消除游戏",
	},
	[17] =
	{
		title = "我在《开心爱消除》关卡模式中收集到了150颗星星！",
		desc = "开心爱消除，最好玩的消除游戏",
	},
	[18] =
	{
		title = "我在《开心爱消除》关卡模式中收集到了180颗星星！",
		desc = "开心爱消除，最好玩的消除游戏",
	},
}

return Text
